package main

import "fmt"

func main() {
	/*
		数据类型
			数值型
			布尔型
			字符串型
			复合类型：数组、切片、map，函数、结构体......

		注：回顾值类型和引用类型的区别
	*/

	/*常量的使用：
		常量是一个简单值的标识符，在程序运行时，数值都不会改变。（百度网址，圆周率等）
		常量不使用，编译时不会报错，与变量不同
		常量中的数据类型只可以是布尔型、数字型（整数、小数、复数）、字符串型
	 常量的语法：
		显示定义： const 常量名 类型 = 数值
		隐式定义	 const 常量名 = 数值
	 常数：
	    固定的数值就叫常数
		比如："abc","110"
	 常量的名称:
		编码习惯上常量的名称字母都是大写的
	 定义常量可以使用内置的函数进行赋值:
		内置函数:不用导包直接使用
	 常量组:
		类似于常量集合
		const(
			m=100
			n="world"
		)
		常量组中如不指定类型和初始化值，则与上一行非空常量最右值相同
	*/

	/*
		标识符：
			变量、常量、函数...命名
			以大写字母开头，表示公有。全局变量
			以小些字母开头，表示私有。本文件中使用
	*/

	/*
		枚举:一组相关的数据
			可以使用常量组作为枚举
	*/
	const cPATH string = "https://www.baidu.com" //显示定义
	const PI = 3.14
	fmt.Println(cPATH)
	fmt.Println(PI)
	fmt.Println(len(cPATH))
}
