package main

import (
	"fmt"
	"math"
)

func main() {
	/*
		练习一：乘法表
		1*1=1
		2*1=2 2*2=4
		3*1=3 3*2=6 3*3=9
		...

		9*1=9 ...9*9=81
	*/

	fmt.Println("------------------------练习一：乘法表-------------------------------")
	{
		for i := 1; i <= 9; i++ {
			for j := 1; j <= i; j++ {
				fmt.Printf("%d*%d=%d\t", i, j, i*j)
			}
			fmt.Println()
		}
	}

	fmt.Println("---------------练习二：水仙花数：三位数：[100,999]---------------------")
	{
		/*
			水仙花数：三位数：[100,999]
				每个位上的数字的立方和，刚好等于该数字本身。那么就叫水仙花数。
			比如153，1+25+27=153
		*/
		fmt.Println("[100,999]的水仙花数有：")
		for i := 100; i < 1000; i++ {
			m := i / 100       //百位数字
			n := (i / 10) % 10 //十位数
			l := i % 10        //个位数
			num := math.Pow(float64(m), 3) + math.Pow(float64(n), 3) + math.Pow(float64(l), 3)
			if float64(i) == num {
				fmt.Printf("%d\t", i)
			}
		}

	}

	fmt.Println("----------练习三：0-9，输出组成的三位数，并输出水仙花数-------------------")
	{
		for c := 1; c < 10; c++ {
			for b := 0; b < 10; b++ {
				for a := 0; a < 10; a++ {
					num := c*100 + b*10 + a
					fmt.Printf("%d\t", num)
					if num%10 == 0 {
						fmt.Println()
					}
					if float64(num) == math.Pow(float64(a), 3)+math.Pow(float64(b), 3)+math.Pow(float64(c), 3) {
						fmt.Print("\n——————————————————————其中水仙花是：")
						fmt.Printf("（ %d ）\n", num)
					}
				}
			}
		}
	}

	fmt.Println("-----------------------练习六：100以内的素数--------------------------")
	{
		for i := 2; i < 100; i++ {
			count := 0 //用于统计
			//验证
			for j := 2; j < i; j++ {
				if i%j == 0 {
					count++
				}
			}
			//结果
			if count == 0 {
				fmt.Println(i, "是素数")
			}
		}
	}

	fmt.Println("-----------------------练习四：百元百鸡--------------------------")
	{
		/*
			百元百鸡：
				一百元钱买一百只鸡，公鸡5元一只，母鸡3元一只，小鸡一元3只。
				取值范围：
					公鸡[0,20] , 母鸡[0,33] , 小鸡[0,100-公鸡-母鸡]

		*/
	}

	fmt.Println("-----------------------练习五：求和2+22+222+2222+22222--------------------------")
	{
		/*
			百元百鸡：
				一百元钱买一百只鸡，公鸡5元一只，母鸡3元一只，小鸡一元3只。
				取值范围：
					公鸡[0,20] , 母鸡[0,33] , 小鸡[0,100-公鸡-母鸡]

		*/
	}
}
