package main

func main() {
	/*
		00.搜索：在某个数组中，查找指定的数据。如果存在返回该数据在数组中的位置。如果不存在返回-1。
			low:  最低点的值
			high：最高点的值
			mid:  中间值（下标）  mid=（low+high）/2
			key： 要查询的值
			A.顺序搜索法:依次查找
			B.二分搜索法，也叫折半查找：前提，数组有序（升序）
				前提low<=high
				首先将key和arr[mid]比较；
				1.key>arr[mid]  ->修改low为arr[mid+1]
				2.key<arr[mid]  ->修改high为arr[mid-1]
				3.key=arr[mid]  ->key为arr[mid]
	*/
	/*
		01.题目：某个公司采用公用电话传递数据，数据是四位数的整数，在传递过程中是加密的，加密规则：
			每位数字都加上5，然后用和 除以10的余数 代替该数字，再将第一位和第四位交换，第二位和第三位交换。
			如：1694
				1->6
				6->11
				9->14
				4->9
				6149->9416
	*/
	/*
		02.题目：给定一个整型数组，长度为10。数字取自随机数。[1,10] 去重
	*/
	/*
		03.题目：有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3），凡报到3的人退出，接着下一个依次进行。
				最后留下1的人是原来的第几号的那位。
	*/
}
